uat_chat/Reports/КонтрольПериодаКонсервации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>КонтрольПериодаКонсервации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Enums/уатВидыСостоянийТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатВидыСостоянийТС</Name>
			<Comment>Виды состояний ТС (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРейсе</Name>
					<Comment>В эксплуатации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПростое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКонсервации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбыло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКонсервацииПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Арендованный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Привлеченный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Reports/КонтрольПериодаКонсервации/Ext/ObjectModule.bsl
Функция ПолучитьДанные(ДатаНачала,ДатаОкончания,ТС = Неопределено) Экспорт
	
	ФильтрПоТС = ТС = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонсервацияТС.ТС КАК ТС,
		|	КонсервацияТС.Период КАК ДатаКонсервации,
		|	ДОБАВИТЬКДАТЕ(КонсервацияТС.Период, МЕСЯЦ, 3) КАК ДатаСброса
		|ПОМЕСТИТЬ ТЗКонсервацияТС
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС КАК КонсервацияТС
		|ГДЕ
		|	КонсервацияТС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И КонсервацияТС.Состояние.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.НаКонсервации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уатСостояниеТС.ТС.ГаражныйНомер КАК ТСГаражныйНомер,
		|	уатСостояниеТС.ТС,
		|	уатСостояниеТС.Состояние,
		|	уатСостояниеТС.Период КАК ДатаСмены,
		|	ТЗТС.ДатаКонсервации КАК ДатаКонсервации
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС КАК уатСостояниеТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗКонсервацияТС КАК ТЗТС
		|		ПО уатСостояниеТС.ТС = ТЗТС.ТС
		|			И уатСостояниеТС.Период > ТЗТС.ДатаКонсервации
		|			И уатСостояниеТС.Период < ТЗТС.ДатаСброса
		|ГДЕ
		|	уатСостояниеТС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатСостояниеТС.Состояние.ВидСостояния <> ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.НаКонсервации)
		|	И уатСостояниеТС.Состояние.ВидСостояния <> ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.Выбыло)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТСГаражныйНомер,
		|	ДатаКонсервации";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ДатаНачала,-3));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ТС", ТС);
	
	Результат = Запрос.Выполнить();
	
	ТЗ = Результат.Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

Функция КонтрольСрокаКонсервации(ТЗ,НовСостояние) Экспорт
	Отказ = Ложь;
	Для каждого ХХХ Из ТЗ Цикл
		Если ЗначениеЗаполнено(ХХХ.ТС) Тогда
			КонтрольнаяДата = ДобавитьМесяц(ХХХ.ДатаВвода,-3);
			ДанныеТС = уатОбщегоНазначения.МестонахождениеТС(ХХХ.ТС, ХХХ.ДатаВвода-1);
			Состояние = ДанныеТС.Состояние;
			ДатаКонсервации = ДанныеТС.Период;
			Если (Состояние.ВидСостояния <> НовСостояние.ВидСостояния) //отсекаем перемещения в рамках одного вида состояния 
				И (Состояние.ВидСостояния = Перечисления.уатВидыСостоянийТС.НаКонсервации) //берем все то, что имеет вид "На консервации"
				И (ДатаКонсервации > КонтрольнаяДата) // берем только тех, где срок меньше указанного (т.е. 3-х месяцев)
				Тогда
				Сообщить("Внимание!!! В строке № " + ХХХ.НомерСтроки + " для ТС гар. номер " + ХХХ.ТС.ГаражныйНомер + " срок консервации был меньше 3-х месяцев: с " + Формат(ДатаКонсервации,"ДЛФ=D") + " по " + Формат(ХХХ.ДатаВвода,"ДЛФ=D") + "!!!");
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ложь;
КонецФункции
